# Data Acquisition

- pulling all our data together
- sanity checking

In [2]:
import pandas as pd

Key things to look at:

- dataframe shape
- datatypes
- head / sample
- summary stats

## Reading from a Google Sheet

Demo: innis_spreadsheet_exercises

In [3]:
url = 'https://docs.google.com/spreadsheets/d/1qyreW29fvdvr8IIh23p0LyV2eL-kPs2v8tJf5-03k1s/edit#gid=1023018493'
# replace /edit with /export?format=csv
url = 'https://docs.google.com/spreadsheets/d/1qyreW29fvdvr8IIh23p0LyV2eL-kPs2v8tJf5-03k1s/export?format=csv#gid=1023018493'
# make sure it's public
pd.read_csv(url)

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.60,593.30,No
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.90,542.40,No
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.90,280.85,Yes
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.00,1237.85,Yes
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.90,267.40,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...
7044,9987-LUTYD,Female,0,No,No,1,1,1,Mailed check,55.15,742.90,No
7045,9992-RRAMN,Male,0,Yes,No,2,2,0,Electronic check,85.10,1873.70,Yes
7046,9992-UJOEL,Male,0,No,No,1,1,0,Mailed check,50.30,92.75,No
7047,9993-LHIEB,Male,0,Yes,Yes,1,1,2,Mailed check,67.85,4627.65,No
7048,9995-HOTOH,Male,0,Yes,Yes,0,1,2,Electronic check,59.00,3707.60,No

In [5]:
df = pd.read_clipboard()

In [9]:
df[['is_senior_citizen', 'monthly_charges']].head(20).to_clipboard(index=False)

## Reading From a URL

In [11]:
pd.read_csv('https://ds.codeup.com/saas.csv').head()

  Month_Invoiced  Customer_Id  Invoice_Id  Subscription_Type  Amount
0     2014-01-31      1000000     5000000                0.0     0.0
1     2014-01-31      1000001     5000001                2.0    10.0
2     2014-01-31      1000002     5000002                0.0     0.0
3     2014-01-31      1000003     5000003                0.0     0.0
4     2014-01-31      1000004     5000004                1.0     5.0

In [13]:
# Trying to read an html website as a csv will produce an error 
# pd.read_csv('https://codeup.com')

## Reading From SQL

- SQL query
- database connection

In [16]:
import env

database = 'numbers'
url = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/{database}'
query = '''
SELECT
    n AS original_number,
    n * 2 AS doubled
FROM numbers
WHERE n > 3
'''

pd.read_sql(query, url)

   original_number  doubled
0                4        8
1                5       10
2                6       12
3                7       14
4                8       16
5                9       18
6               10       20

## Data Caching

With a csv or json file.

1. Acquire the data
2. Save the data as a csv
3. On subsequent reads, use the csv file

In [17]:
df = pd.read_sql(query, url)
df

   original_number  doubled
0                4        8
1                5       10
2                6       12
3                7       14
4                8       16
5                9       18
6               10       20

to_csv and read_csv will default to the same directory as the notebook

In [18]:
df.to_csv('numbers.csv', index=False)

In [19]:
pd.read_csv('numbers.csv')

   original_number  doubled
0                4        8
1                5       10
2                6       12
3                7       14
4                8       16
5                9       18
6               10       20

In [33]:
import os

def get_number_data():
    filename = 'numbers.csv'
    
    if os.path.exists(filename):
        print('Reading from csv file...')
        return pd.read_csv(filename)
    
    database = 'numbers'
    url = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/{database}'
    query = '''
    SELECT
        n AS original_number,
        n * 2 AS doubled
    FROM numbers
    WHERE n > 3
    '''

    print('Getting a fresh copy from SQL database...')
    df = pd.read_sql(query, url)
    print('Saving to csv...')
    df.to_csv(filename, index=False)
    return df

In [43]:
get_number_data()

Reading from csv file...

   original_number  doubled
0                4        8
1                5       10
2                6       12
3                7       14
4                8       16
5                9       18
6               10       20

In [48]:
df.to_json('numbers.json', orient='records', indent=1)

- CSV: Comma Seperated Values; more common in data / non-programming folk world
- JSON: Javascript Object Notation; more common in the programming world

Formats for sharing or storing data